In [1]:
import pandas as pd

In [2]:
data = {'names': ['Alice', 'John', 'Mark', 'Carol'],
       'ids': [101, 102, 103, 104],
       'percents': [78.5, 87.5, 68.0, 91.5]}

In [3]:
df = pd.DataFrame(data, columns=['ids', 'names', 'percents'])

In [4]:
df

   ids  names  percents
0  101  Alice      78.5
1  102   John      87.5
2  103   Mark      68.0
3  104  Carol      91.5

In [5]:
# Create a column called 'award'.
# True or False
# True if the percent is more than 85, else False

In [6]:
df['percents']

0    78.5
1    87.5
2    68.0
3    91.5
Name: percents, dtype: float64

In [7]:
df['percents'] > 85

0    False
1     True
2    False
3     True
Name: percents, dtype: bool

In [8]:
df['awards'] = (df['percents'] > 85)

In [9]:
df

   ids  names  percents  awards
0  101  Alice      78.5   False
1  102   John      87.5    True
2  103   Mark      68.0   False
3  104  Carol      91.5    True

In [11]:
s1 = pd.Series([8, 3, 5, 0, 5, 2], index=[3, 5, 2, 1, 8, 7])

In [12]:
s1

3    8
5    3
2    5
1    0
8    5
7    2
dtype: int64

In [13]:
df

   ids  names  percents  awards
0  101  Alice      78.5   False
1  102   John      87.5    True
2  103   Mark      68.0   False
3  104  Carol      91.5    True

In [14]:
df['col1'] = s1

In [15]:
df

   ids  names  percents  awards  col1
0  101  Alice      78.5   False   NaN
1  102   John      87.5    True   0.0
2  103   Mark      68.0   False   5.0
3  104  Carol      91.5    True   8.0

In [19]:
# Since NaN is assigned as one of the values of the column col1, 
# all other values change to float as well.
# As NaN is of type numpy.float64

In [17]:
df.drop(['awards', 'col1'], axis=1, inplace=True)

In [18]:
df

   ids  names  percents
0  101  Alice      78.5
1  102   John      87.5
2  103   Mark      68.0
3  104  Carol      91.5

In [20]:
# create a column 'sports'

In [21]:
df['sports'] = ['No', 'No', 'Yes', 'No']

In [22]:
df

   ids  names  percents sports
0  101  Alice      78.5     No
1  102   John      87.5     No
2  103   Mark      68.0    Yes
3  104  Carol      91.5     No

In [23]:
# Create a column called 'award'.
# True or False
# True if the percent is more than 85 OR sports is 'Yes', else False

In [26]:
df['award'] = (df['percents'] > 85) or (df['sports'] == 'Yes')

ValueError: The truth value of a Series is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().

In [27]:
df['award'] = (df['percents'] > 85) | (df['sports'] == 'Yes')

In [28]:
df

   ids  names  percents sports  award
0  101  Alice      78.5     No  False
1  102   John      87.5     No   True
2  103   Mark      68.0    Yes   True
3  104  Carol      91.5     No   True

In [29]:
df['sports'] = ['No', 'No', 'Yes', 'Yes']

In [30]:
df

   ids  names  percents sports  award
0  101  Alice      78.5     No  False
1  102   John      87.5     No   True
2  103   Mark      68.0    Yes   True
3  104  Carol      91.5    Yes   True

In [31]:
# CHnage column called 'award'.
# True or False
# True if the percent is more than 85 AND sports is 'Yes', else False

In [32]:
df['award'] = (df['percents'] > 85) & (df['sports'] == 'Yes')

In [33]:
df

   ids  names  percents sports  award
0  101  Alice      78.5     No  False
1  102   John      87.5     No  False
2  103   Mark      68.0    Yes  False
3  104  Carol      91.5    Yes   True

In [34]:
# Create a new column - 'grades'
# Values:
# percent > 90 => 'A'
# 90 > percent > 80 => 'B'
# 80 > percent > 70 => 'C'
# 70 > percent > 60 => 'D'
# percent < 60 => 'F'

In [35]:
# numpy.select?

In [36]:
import numpy as np

In [37]:
help(np.select)

Help on function select in module numpy:

select(condlist, choicelist, default=0)
    Return an array drawn from elements in choicelist, depending on conditions.

    Parameters
    ----------
    condlist : list of bool ndarrays
        The list of conditions which determine from which array in `choicelist`
        the output elements are taken. When multiple conditions are satisfied,
        the first one encountered in `condlist` is used.
    choicelist : list of ndarrays
        The list of arrays from which the output elements are taken. It has
        to be of the same length as `condlist`.
    default : scalar, optional
        The element inserted in `output` when all conditions evaluate to False.

    Returns
    -------
    output : ndarray
        The output at position m is the m-th element of the array in
        `choicelist` where the m-th element of the corresponding array in
        `condlist` is True.

    See Also
    --------
    where : Return elements from one of two arrays depending on condition.
    take, choose, compress, diag, diagonal

    Examples
    --------
    >>> x = np.arange(10)
    >>> condlist = [x<3, x>5]
    >>> choicelist = [x, x**2]
    >>> np.select(condlist, choicelist)
    array([ 0,  1,  2, ..., 49, 64, 81])

In [38]:
help(np.random.randint)

Help on built-in function randint:

randint(...) method of numpy.random.mtrand.RandomState instance
    randint(low, high=None, size=None, dtype=int)

    Return random integers from `low` (inclusive) to `high` (exclusive).

    Return random integers from the "discrete uniform" distribution of
    the specified dtype in the "half-open" interval [`low`, `high`). If
    `high` is None (the default), then results are from [0, `low`).

    .. note::
        New code should use the ``integers`` method of a ``default_rng()``
        instance instead; please see the :ref:`random-quick-start`.

    Parameters
    ----------
    low : int or array-like of ints
        Lowest (signed) integers to be drawn from the distribution (unless
        ``high=None``, in which case this parameter is one above the
        *highest* such integer).
    high : int or array-like of ints, optional
        If provided, one above the largest (signed) integer to be drawn
        from the distribution (see above for behavior if ``high=None``).
        If array-like, must contain integer values
    size : int or tuple of ints, optional
        Output shape.  If the given shape is, e.g., ``(m, n, k)``, then
        ``m * n * k`` samples are drawn.  Default is None, in which case a
        single value is returned.
    dtype : dtype, optional
        Desired dtype of the result. Byteorder must be native.
        The default value is int.

        .. versionadded:: 1.11.0

    Returns
    -------
    out : int or ndarray of ints
        `size`-shaped array of random integers from the appropriate
        distribution, or a single such random int if `size` not provided.

    See Also
    --------
    random_integers : similar to `randint`, only for the closed
        interval [`low`, `high`], and 1 is the lowest value if `high` is
        omitted.
    Generator.integers: which should be used for new code.

    Examples
    --------
    >>> np.random.randint(2, size=10)
    array([1, 0, 0, 0, 1, 1, 0, 0, 1, 0]) # random
    >>> np.random.randint(1, size=10)
    array([0, 0, 0, 0, 0, 0, 0, 0, 0, 0])

    Generate a 2 x 4 array of ints between 0 and 4, inclusive:

    >>> np.random.randint(5, size=(2, 4))
    array([[4, 0, 2, 1], # random
           [3, 2, 2, 0]])

    Generate a 1 x 3 array with 3 different upper bounds

    >>> np.random.randint(1, [3, 5, 10])
    array([2, 2, 9]) # random

    Generate a 1 by 3 array with 3 different lower bounds

    >>> np.random.randint([1, 5, 7], 10)
    array([9, 8, 7]) # random

    Generate a 2 by 4 array using broadcasting with dtype of uint8

    >>> np.random.randint([1, 3, 5, 7], [[10], [20]], dtype=np.uint8)
    array([[ 8,  6,  9,  7], # random
           [ 1, 16,  9, 12]], dtype=uint8)

In [39]:
arr1 = np.random.randint(10, 100, 10)

In [40]:
arr1

array([23, 15, 92, 39, 70, 28, 57, 73, 45, 79])

In [41]:
np.random.randint(10, 100, 10)

array([58, 28, 47, 63, 96, 13, 86, 12, 30, 12])

In [42]:
# if element < 30 => 'Small'
# if 30 >= element < 70 => 'Medium'
# if element >= 70 => 'Big'

In [43]:
arr1

array([23, 15, 92, 39, 70, 28, 57, 73, 45, 79])

In [44]:
cond_list = [arr1 < 30, (arr1 >= 30) & (arr1 < 70), arr1 >= 70]
ch_list = ['Small', 'Medium', 'Big']
np.select(cond_list, ch_list)

array(['Small', 'Small', 'Big', 'Medium', 'Big', 'Small', 'Medium', 'Big',
       'Medium', 'Big'], dtype='<U11')

In [45]:
df

   ids  names  percents sports  award
0  101  Alice      78.5     No  False
1  102   John      87.5     No  False
2  103   Mark      68.0    Yes  False
3  104  Carol      91.5    Yes   True

In [46]:
cond_list = [df['percents'] >= 90, (df['percents'] >= 80) & (df['percents'] < 90),
            (df['percents'] >= 70) & (df['percents'] < 80), 
            (df['percents'] >= 60) & (df['percents'] < 70)]

ch_list = ['A', 'B', 'C', 'D']
def_grade = 'F'

df['grades'] = np.select(cond_list, ch_list, def_grade)

In [47]:
df

   ids  names  percents sports  award grades
0  101  Alice      78.5     No  False      C
1  102   John      87.5     No  False      B
2  103   Mark      68.0    Yes  False      D
3  104  Carol      91.5    Yes   True      A

In [48]:
np.select(cond_list, ch_list, def_grade)

array(['C', 'B', 'D', 'A'], dtype='<U1')

In [49]:
# Sorting of dataframes

In [50]:
df

   ids  names  percents sports  award grades
0  101  Alice      78.5     No  False      C
1  102   John      87.5     No  False      B
2  103   Mark      68.0    Yes  False      D
3  104  Carol      91.5    Yes   True      A

In [51]:
df.sort_index()

   ids  names  percents sports  award grades
0  101  Alice      78.5     No  False      C
1  102   John      87.5     No  False      B
2  103   Mark      68.0    Yes  False      D
3  104  Carol      91.5    Yes   True      A

In [53]:
df.sort_index(ascending=False)

   ids  names  percents sports  award grades
3  104  Carol      91.5    Yes   True      A
2  103   Mark      68.0    Yes  False      D
1  102   John      87.5     No  False      B
0  101  Alice      78.5     No  False      C

In [54]:
df

   ids  names  percents sports  award grades
0  101  Alice      78.5     No  False      C
1  102   John      87.5     No  False      B
2  103   Mark      68.0    Yes  False      D
3  104  Carol      91.5    Yes   True      A

In [55]:
df.sort_values()

TypeError: sort_values() missing 1 required positional argument: 'by'

In [56]:
df.sort_values(by='percents')

   ids  names  percents sports  award grades
2  103   Mark      68.0    Yes  False      D
0  101  Alice      78.5     No  False      C
1  102   John      87.5     No  False      B
3  104  Carol      91.5    Yes   True      A

In [57]:
df.sort_values(by='percents', ascending=False)

   ids  names  percents sports  award grades
3  104  Carol      91.5    Yes   True      A
1  102   John      87.5     No  False      B
0  101  Alice      78.5     No  False      C
2  103   Mark      68.0    Yes  False      D

In [58]:
help(df.sort_values)

Help on method sort_values in module pandas.core.frame:

sort_values(by, axis: 'Axis' = 0, ascending=True, inplace: 'bool' = False, kind: 'str' = 'quicksort', na_position: 'str' = 'last', ignore_index: 'bool' = False, key: 'ValueKeyFunc' = None) method of pandas.core.frame.DataFrame instance
    Sort by the values along either axis.

    Parameters
    ----------
            by : str or list of str
                Name or list of names to sort by.

                - if `axis` is 0 or `'index'` then `by` may contain index
                  levels and/or column labels.
                - if `axis` is 1 or `'columns'` then `by` may contain column
                  levels and/or index labels.
    axis : {0 or 'index', 1 or 'columns'}, default 0
         Axis to be sorted.
    ascending : bool or list of bool, default True
         Sort ascending vs. descending. Specify list for multiple sort
         orders.  If this is a list of bools, must match the length of
         the by.
    inplace : bool, default False
         If True, perform operation in-place.
    kind : {'quicksort', 'mergesort', 'heapsort', 'stable'}, default 'quicksort'
         Choice of sorting algorithm. See also :func:`numpy.sort` for more
         information. `mergesort` and `stable` are the only stable algorithms. For
         DataFrames, this option is only applied when sorting on a single
         column or label.
    na_position : {'first', 'last'}, default 'last'
         Puts NaNs at the beginning if `first`; `last` puts NaNs at the
         end.
    ignore_index : bool, default False
         If True, the resulting axis will be labeled 0, 1, …, n - 1.

         .. versionadded:: 1.0.0

    key : callable, optional
        Apply the key function to the values
        before sorting. This is similar to the `key` argument in the
        builtin :meth:`sorted` function, with the notable difference that
        this `key` function should be *vectorized*. It should expect a
        ``Series`` and return a Series with the same shape as the input.
        It will be applied to each column in `by` independently.

        .. versionadded:: 1.1.0

    Returns
    -------
    DataFrame or None
        DataFrame with sorted values or None if ``inplace=True``.

    See Also
    --------
    DataFrame.sort_index : Sort a DataFrame by the index.
    Series.sort_values : Similar method for a Series.

    Examples
    --------
    >>> df = pd.DataFrame({
    ...     'col1': ['A', 'A', 'B', np.nan, 'D', 'C'],
    ...     'col2': [2, 1, 9, 8, 7, 4],
    ...     'col3': [0, 1, 9, 4, 2, 3],
    ...     'col4': ['a', 'B', 'c', 'D', 'e', 'F']
    ... })
    >>> df
      col1  col2  col3 col4
    0    A     2     0    a
    1    A     1     1    B
    2    B     9     9    c
    3  NaN     8     4    D
    4    D     7     2    e
    5    C     4     3    F

    Sort by col1

    >>> df.sort_values(by=['col1'])
      col1  col2  col3 col4
    0    A     2     0    a
    1    A     1     1    B
    2    B     9     9    c
    5    C     4     3    F
    4    D     7     2    e
    3  NaN     8     4    D

    Sort by multiple columns

    >>> df.sort_values(by=['col1', 'col2'])
      col1  col2  col3 col4
    1    A     1     1    B
    0    A     2     0    a
    2    B     9     9    c
    5    C     4     3    F
    4    D     7     2    e
    3  NaN     8     4    D

    Sort Descending

    >>> df.sort_values(by='col1', ascending=False)
      col1  col2  col3 col4
    4    D     7     2    e
    5    C     4     3    F
    2    B     9     9    c
    0    A     2     0    a
    1    A     1     1    B
    3  NaN     8     4    D

    Putting NAs first

    >>> df.sort_values(by='col1', ascending=False, na_position='first')
      col1  col2  col3 col4
    3  NaN     8     4    D
    4    D     7     2    e
    5    C     4     3    F
    2    B     9     9    c
    0    A     2     0    a
    1    A     1     1    B

    Sorting with a key function

    >>> df.sort_values(by='col4', key=lambda col: col.str.lower())
       col1  col2  col3 col4
    0    A     2     0    a
    1    A     1     1    B
    2    B     9     9    c
    3  NaN     8     4    D
    4    D     7     2    e
    5    C     4     3    F

    Natural sort with the key argument,
    using the `natsort <https://github.com/SethMMorton/natsort>` package.

    >>> df = pd.DataFrame({
    ...    "time": ['0hr', '128hr', '72hr', '48hr', '96hr'],
    ...    "value": [10, 20, 30, 40, 50]
    ... })
    >>> df
        time  value
    0    0hr     10
    1  128hr     20
    2   72hr     30
    3   48hr     40
    4   96hr     50
    >>> from natsort import index_natsorted
    >>> df.sort_values(
    ...    by="time",
    ...    key=lambda x: np.argsort(index_natsorted(df["time"]))
    ... )
        time  value
    0    0hr     10
    3   48hr     40
    2   72hr     30
    4   96hr     50
    1  128hr     20

In [59]:
df

   ids  names  percents sports  award grades
0  101  Alice      78.5     No  False      C
1  102   John      87.5     No  False      B
2  103   Mark      68.0    Yes  False      D
3  104  Carol      91.5    Yes   True      A

In [71]:
data1 = {'ids': [105], 'names': ['Dan'], 'percents': [68], 'sports': ['No'], 'award': [False], 'grades': ['D']}

In [72]:
df1 = pd.DataFrame(data1)

In [73]:
df1

   ids names  percents sports  award grades
0  105   Dan        68     No  False      D

In [74]:
df = pd.concat([df, df1])

In [75]:
df

   ids  names  percents sports  award grades
0  101  Alice      78.5     No  False      C
1  102   John      87.5     No  False      B
2  103   Mark      68.0    Yes  False      D
3  104  Carol      91.5    Yes   True      A
4  105    Dan      55.0     No  False      F
0  105    Dan      68.0     No  False      D

In [77]:
df.index = [0,1,2,3,4, 5]

In [78]:
df

   ids  names  percents sports  award grades
0  101  Alice      78.5     No  False      C
1  102   John      87.5     No  False      B
2  103   Mark      68.0    Yes  False      D
3  104  Carol      91.5    Yes   True      A
4  105    Dan      55.0     No  False      F
5  105    Dan      68.0     No  False      D

In [79]:
df.drop([4], inplace=True)

In [80]:
df

   ids  names  percents sports  award grades
0  101  Alice      78.5     No  False      C
1  102   John      87.5     No  False      B
2  103   Mark      68.0    Yes  False      D
3  104  Carol      91.5    Yes   True      A
5  105    Dan      68.0     No  False      D

In [81]:
df.sort_values(by='percents')

   ids  names  percents sports  award grades
2  103   Mark      68.0    Yes  False      D
5  105    Dan      68.0     No  False      D
0  101  Alice      78.5     No  False      C
1  102   John      87.5     No  False      B
3  104  Carol      91.5    Yes   True      A

In [82]:
help(df.sort_values)

Help on method sort_values in module pandas.core.frame:

sort_values(by, axis: 'Axis' = 0, ascending=True, inplace: 'bool' = False, kind: 'str' = 'quicksort', na_position: 'str' = 'last', ignore_index: 'bool' = False, key: 'ValueKeyFunc' = None) method of pandas.core.frame.DataFrame instance
    Sort by the values along either axis.

    Parameters
    ----------
            by : str or list of str
                Name or list of names to sort by.

                - if `axis` is 0 or `'index'` then `by` may contain index
                  levels and/or column labels.
                - if `axis` is 1 or `'columns'` then `by` may contain column
                  levels and/or index labels.
    axis : {0 or 'index', 1 or 'columns'}, default 0
         Axis to be sorted.
    ascending : bool or list of bool, default True
         Sort ascending vs. descending. Specify list for multiple sort
         orders.  If this is a list of bools, must match the length of
         the by.
    inplace : bool, default False
         If True, perform operation in-place.
    kind : {'quicksort', 'mergesort', 'heapsort', 'stable'}, default 'quicksort'
         Choice of sorting algorithm. See also :func:`numpy.sort` for more
         information. `mergesort` and `stable` are the only stable algorithms. For
         DataFrames, this option is only applied when sorting on a single
         column or label.
    na_position : {'first', 'last'}, default 'last'
         Puts NaNs at the beginning if `first`; `last` puts NaNs at the
         end.
    ignore_index : bool, default False
         If True, the resulting axis will be labeled 0, 1, …, n - 1.

         .. versionadded:: 1.0.0

    key : callable, optional
        Apply the key function to the values
        before sorting. This is similar to the `key` argument in the
        builtin :meth:`sorted` function, with the notable difference that
        this `key` function should be *vectorized*. It should expect a
        ``Series`` and return a Series with the same shape as the input.
        It will be applied to each column in `by` independently.

        .. versionadded:: 1.1.0

    Returns
    -------
    DataFrame or None
        DataFrame with sorted values or None if ``inplace=True``.

    See Also
    --------
    DataFrame.sort_index : Sort a DataFrame by the index.
    Series.sort_values : Similar method for a Series.

    Examples
    --------
    >>> df = pd.DataFrame({
    ...     'col1': ['A', 'A', 'B', np.nan, 'D', 'C'],
    ...     'col2': [2, 1, 9, 8, 7, 4],
    ...     'col3': [0, 1, 9, 4, 2, 3],
    ...     'col4': ['a', 'B', 'c', 'D', 'e', 'F']
    ... })
    >>> df
      col1  col2  col3 col4
    0    A     2     0    a
    1    A     1     1    B
    2    B     9     9    c
    3  NaN     8     4    D
    4    D     7     2    e
    5    C     4     3    F

    Sort by col1

    >>> df.sort_values(by=['col1'])
      col1  col2  col3 col4
    0    A     2     0    a
    1    A     1     1    B
    2    B     9     9    c
    5    C     4     3    F
    4    D     7     2    e
    3  NaN     8     4    D

    Sort by multiple columns

    >>> df.sort_values(by=['col1', 'col2'])
      col1  col2  col3 col4
    1    A     1     1    B
    0    A     2     0    a
    2    B     9     9    c
    5    C     4     3    F
    4    D     7     2    e
    3  NaN     8     4    D

    Sort Descending

    >>> df.sort_values(by='col1', ascending=False)
      col1  col2  col3 col4
    4    D     7     2    e
    5    C     4     3    F
    2    B     9     9    c
    0    A     2     0    a
    1    A     1     1    B
    3  NaN     8     4    D

    Putting NAs first

    >>> df.sort_values(by='col1', ascending=False, na_position='first')
      col1  col2  col3 col4
    3  NaN     8     4    D
    4    D     7     2    e
    5    C     4     3    F
    2    B     9     9    c
    0    A     2     0    a
    1    A     1     1    B

    Sorting with a key function

    >>> df.sort_values(by='col4', key=lambda col: col.str.lower())
       col1  col2  col3 col4
    0    A     2     0    a
    1    A     1     1    B
    2    B     9     9    c
    3  NaN     8     4    D
    4    D     7     2    e
    5    C     4     3    F

    Natural sort with the key argument,
    using the `natsort <https://github.com/SethMMorton/natsort>` package.

    >>> df = pd.DataFrame({
    ...    "time": ['0hr', '128hr', '72hr', '48hr', '96hr'],
    ...    "value": [10, 20, 30, 40, 50]
    ... })
    >>> df
        time  value
    0    0hr     10
    1  128hr     20
    2   72hr     30
    3   48hr     40
    4   96hr     50
    >>> from natsort import index_natsorted
    >>> df.sort_values(
    ...    by="time",
    ...    key=lambda x: np.argsort(index_natsorted(df["time"]))
    ... )
        time  value
    0    0hr     10
    3   48hr     40
    2   72hr     30
    4   96hr     50
    1  128hr     20

In [83]:
df.sort_values(by=['percents', 'names'])

   ids  names  percents sports  award grades
5  105    Dan      68.0     No  False      D
2  103   Mark      68.0    Yes  False      D
0  101  Alice      78.5     No  False      C
1  102   John      87.5     No  False      B
3  104  Carol      91.5    Yes   True      A

In [84]:
# Read an Excel as dataframe

In [85]:
shares_df = pd.read_excel('share_example.xlsx')

In [86]:
shares_df

        Date    A  B    C   D     E
0 2022-01-20   99  20  45  56  2000
1 2022-01-21   98  19  47  55  1993
2 2022-01-22   95  19  50  60  1921
3 2022-01-23  101  22  56  61  1976
4 2022-01-24  103  22  55  65  2010

In [87]:
shares_df.columns

Index(['Date', 'A', 'B ', 'C', 'D', 'E'], dtype='object')

In [88]:
shares_df.index

RangeIndex(start=0, stop=5, step=1)

In [89]:
shares_df.values

array([[Timestamp('2022-01-20 00:00:00'), 99, 20, 45, 56, 2000],
       [Timestamp('2022-01-21 00:00:00'), 98, 19, 47, 55, 1993],
       [Timestamp('2022-01-22 00:00:00'), 95, 19, 50, 60, 1921],
       [Timestamp('2022-01-23 00:00:00'), 101, 22, 56, 61, 1976],
       [Timestamp('2022-01-24 00:00:00'), 103, 22, 55, 65, 2010]],
      dtype=object)

In [90]:
shares_df['Date'].loc[0]

Timestamp('2022-01-20 00:00:00')

In [91]:
type(shares_df['Date'].loc[0])

pandas._libs.tslibs.timestamps.Timestamp

In [92]:
# Stack

In [93]:
shares_df

        Date    A  B    C   D     E
0 2022-01-20   99  20  45  56  2000
1 2022-01-21   98  19  47  55  1993
2 2022-01-22   95  19  50  60  1921
3 2022-01-23  101  22  56  61  1976
4 2022-01-24  103  22  55  65  2010

In [94]:
shares_df.stack()

0  Date    2022-01-20 00:00:00
   A                        99
   B                        20
   C                        45
   D                        56
   E                      2000
1  Date    2022-01-21 00:00:00
   A                        98
   B                        19
   C                        47
   D                        55
   E                      1993
2  Date    2022-01-22 00:00:00
   A                        95
   B                        19
   C                        50
   D                        60
   E                      1921
3  Date    2022-01-23 00:00:00
   A                       101
   B                        22
   C                        56
   D                        61
   E                      1976
4  Date    2022-01-24 00:00:00
   A                       103
   B                        22
   C                        55
   D                        65
   E                      2010
dtype: object

In [95]:
shares_stacked = shares_df.stack()

In [96]:
shares_stacked

0  Date    2022-01-20 00:00:00
   A                        99
   B                        20
   C                        45
   D                        56
   E                      2000
1  Date    2022-01-21 00:00:00
   A                        98
   B                        19
   C                        47
   D                        55
   E                      1993
2  Date    2022-01-22 00:00:00
   A                        95
   B                        19
   C                        50
   D                        60
   E                      1921
3  Date    2022-01-23 00:00:00
   A                       101
   B                        22
   C                        56
   D                        61
   E                      1976
4  Date    2022-01-24 00:00:00
   A                       103
   B                        22
   C                        55
   D                        65
   E                      2010
dtype: object

In [97]:
shares_stacked.index

MultiIndex([(0, 'Date'),
            (0,    'A'),
            (0,   'B '),
            (0,    'C'),
            (0,    'D'),
            (0,    'E'),
            (1, 'Date'),
            (1,    'A'),
            (1,   'B '),
            (1,    'C'),
            (1,    'D'),
            (1,    'E'),
            (2, 'Date'),
            (2,    'A'),
            (2,   'B '),
            (2,    'C'),
            (2,    'D'),
            (2,    'E'),
            (3, 'Date'),
            (3,    'A'),
            (3,   'B '),
            (3,    'C'),
            (3,    'D'),
            (3,    'E'),
            (4, 'Date'),
            (4,    'A'),
            (4,   'B '),
            (4,    'C'),
            (4,    'D'),
            (4,    'E')],
           )

In [98]:
shares_stacked.loc[(4, 'D')]

65

In [99]:
shares_stacked.values

array([Timestamp('2022-01-20 00:00:00'), 99, 20, 45, 56, 2000,
       Timestamp('2022-01-21 00:00:00'), 98, 19, 47, 55, 1993,
       Timestamp('2022-01-22 00:00:00'), 95, 19, 50, 60, 1921,
       Timestamp('2022-01-23 00:00:00'), 101, 22, 56, 61, 1976,
       Timestamp('2022-01-24 00:00:00'), 103, 22, 55, 65, 2010],
      dtype=object)

In [100]:
shares_stacked.ndim

1

In [101]:
shares_stacked.shape

(30,)

In [102]:
shares_df

        Date    A  B    C   D     E
0 2022-01-20   99  20  45  56  2000
1 2022-01-21   98  19  47  55  1993
2 2022-01-22   95  19  50  60  1921
3 2022-01-23  101  22  56  61  1976
4 2022-01-24  103  22  55  65  2010

In [103]:
shares_df['C'].loc[2]

50

In [104]:
shares_stacked.loc[2, 'C']

50

In [105]:
shares_stacked

0  Date    2022-01-20 00:00:00
   A                        99
   B                        20
   C                        45
   D                        56
   E                      2000
1  Date    2022-01-21 00:00:00
   A                        98
   B                        19
   C                        47
   D                        55
   E                      1993
2  Date    2022-01-22 00:00:00
   A                        95
   B                        19
   C                        50
   D                        60
   E                      1921
3  Date    2022-01-23 00:00:00
   A                       101
   B                        22
   C                        56
   D                        61
   E                      1976
4  Date    2022-01-24 00:00:00
   A                       103
   B                        22
   C                        55
   D                        65
   E                      2010
dtype: object

In [106]:
shares_stacked.unstack()

        Date    A  B    C   D     E
0 2022-01-20   99  20  45  56  2000
1 2022-01-21   98  19  47  55  1993
2 2022-01-22   95  19  50  60  1921
3 2022-01-23  101  22  56  61  1976
4 2022-01-24  103  22  55  65  2010

In [107]:
data = {'company': ['A', 'B', 'C', 'C', 'B', 'B', 'A', 'D', 'D'],
       'year': [2018, 2018, 2018, 2019, 2019, 2020, 2019, 2018, 2019],
       'sales': [100, 89, 70, 85, 67, 110, 76, 56, 71],
       'profits': [11, 9, 4, 17, 20, -10, 7, 7, 18]}

In [108]:
data_df = pd.DataFrame(data)

In [109]:
data_df

  company  year  sales  profits
0       A  2018    100       11
1       B  2018     89        9
2       C  2018     70        4
3       C  2019     85       17
4       B  2019     67       20
5       B  2020    110      -10
6       A  2019     76        7
7       D  2018     56        7
8       D  2019     71       18

In [110]:
# fetch the data for company 'B'

In [111]:
data_df['company'] == 'B'

0    False
1     True
2    False
3    False
4     True
5     True
6    False
7    False
8    False
Name: company, dtype: bool

In [112]:
data_df[data_df['company'] == 'B']

  company  year  sales  profits
1       B  2018     89        9
4       B  2019     67       20
5       B  2020    110      -10

In [113]:
data_df[data_df['year'] == 2019]

  company  year  sales  profits
3       C  2019     85       17
4       B  2019     67       20
6       A  2019     76        7
8       D  2019     71       18

In [118]:
data_df[data_df['year'] == 2019].sort_values(by='profits', ascending=False)

  company  year  sales  profits
4       B  2019     67       20
8       D  2019     71       18
3       C  2019     85       17
6       A  2019     76        7

In [119]:
# fetch company's 'C' data for 2018

In [120]:
data_df[(data_df['company'] == 'C') & (data_df['year'] == 2018)]

  company  year  sales  profits
2       C  2018     70        4

In [121]:
# fetch company's B profits

In [122]:
data_df[(data_df['company'] == 'B')]

  company  year  sales  profits
1       B  2018     89        9
4       B  2019     67       20
5       B  2020    110      -10

In [123]:
data_df[(data_df['company'] == 'B')]['profits']

1     9
4    20
5   -10
Name: profits, dtype: int64

In [124]:
# mean of profits of company 'B'

In [125]:
data_df[(data_df['company'] == 'B')]['profits'].mean()

6.333333333333333

In [126]:
# media of sales of company A
data_df[(data_df['company'] == 'A')]['sales'].median()

88.0

In [128]:
data_df[(data_df['company'] == 'A')]['sales'].sum()

176

In [131]:
data_df[(data_df['company'] == 'A')]

  company  year  sales  profits
0       A  2018    100       11
6       A  2019     76        7

In [130]:
data_df[(data_df['company'] == 'A')]['sales'].std()

16.97056274847714

In [132]:
data_df[(data_df['company'] == 'A')]['sales'].mode()

0     76
1    100
dtype: int64

In [133]:
data_df

  company  year  sales  profits
0       A  2018    100       11
1       B  2018     89        9
2       C  2018     70        4
3       C  2019     85       17
4       B  2019     67       20
5       B  2020    110      -10
6       A  2019     76        7
7       D  2018     56        7
8       D  2019     71       18

In [134]:
data_df['company'].mode()

0    B
dtype: object

In [135]:
# Pivot

In [136]:
pivot_data = data_df.pivot(index='company', columns='year', values='profits')

In [137]:
pivot_data

year     2018  2019  2020
company
A        11.0   7.0   NaN
B         9.0  20.0 -10.0
C         4.0  17.0   NaN
D         7.0  18.0   NaN

In [138]:
data_df

  company  year  sales  profits
0       A  2018    100       11
1       B  2018     89        9
2       C  2018     70        4
3       C  2019     85       17
4       B  2019     67       20
5       B  2020    110      -10
6       A  2019     76        7
7       D  2018     56        7
8       D  2019     71       18

In [140]:
data_df['company'].unique()

array(['A', 'B', 'C', 'D'], dtype=object)

In [141]:
data_df['year'].unique()

array([2018, 2019, 2020], dtype=int64)

In [142]:
data_df.pivot(index='year', columns='company', values='sales')

company      A      B     C     D
year
2018     100.0   89.0  70.0  56.0
2019      76.0   67.0  85.0  71.0
2020       NaN  110.0   NaN   NaN

In [143]:
data_df.pivot(index='year', columns='company')

         sales                    profits
company      A      B     C     D       A     B     C     D
year
2018     100.0   89.0  70.0  56.0    11.0   9.0   4.0   7.0
2019      76.0   67.0  85.0  71.0     7.0  20.0  17.0  18.0
2020       NaN  110.0   NaN   NaN     NaN -10.0   NaN   NaN

In [144]:
data1 = {'company': ['A', 'A', 'B', 'C', 'C', 'B', 'B', 'A', 'D', 'D'],
       'year': [2018, 2018, 2018, 2018, 2019, 2019, 2020, 2019, 2018, 2019],
       'sales': [100, 99, 89, 70, 85, 67, 110, 76, 56, 71],
       'profits': [11, 10, 9, 4, 17, 20, -10, 7, 7, 18]}

In [145]:
df1 = pd.DataFrame(data1)

In [146]:
df1

  company  year  sales  profits
0       A  2018    100       11
1       A  2018     99       10
2       B  2018     89        9
3       C  2018     70        4
4       C  2019     85       17
5       B  2019     67       20
6       B  2020    110      -10
7       A  2019     76        7
8       D  2018     56        7
9       D  2019     71       18

In [148]:
df1.pivot(index='company', columns='year', values='profits')

ValueError: Index contains duplicate entries, cannot reshape

In [149]:
help(df1.pivot)

Help on method pivot in module pandas.core.frame:

pivot(index=None, columns=None, values=None) -> 'DataFrame' method of pandas.core.frame.DataFrame instance
    Return reshaped DataFrame organized by given index / column values.

    Reshape data (produce a "pivot" table) based on column values. Uses
    unique values from specified `index` / `columns` to form axes of the
    resulting DataFrame. This function does not support data
    aggregation, multiple values will result in a MultiIndex in the
    columns. See the :ref:`User Guide <reshaping>` for more on reshaping.

    Parameters
    ----------
    index : str or object or a list of str, optional
        Column to use to make new frame's index. If None, uses
        existing index.

        .. versionchanged:: 1.1.0
           Also accept list of index names.

    columns : str or object or a list of str
        Column to use to make new frame's columns.

        .. versionchanged:: 1.1.0
           Also accept list of columns names.

    values : str, object or a list of the previous, optional
        Column(s) to use for populating new frame's values. If not
        specified, all remaining columns will be used and the result will
        have hierarchically indexed columns.

    Returns
    -------
    DataFrame
        Returns reshaped DataFrame.

    Raises
    ------
    ValueError:
        When there are any `index`, `columns` combinations with multiple
        values. `DataFrame.pivot_table` when you need to aggregate.

    See Also
    --------
    DataFrame.pivot_table : Generalization of pivot that can handle
        duplicate values for one index/column pair.
    DataFrame.unstack : Pivot based on the index values instead of a
        column.
    wide_to_long : Wide panel to long format. Less flexible but more
        user-friendly than melt.

    Notes
    -----
    For finer-tuned control, see hierarchical indexing documentation along
    with the related stack/unstack methods.

    Examples
    --------
    >>> df = pd.DataFrame({'foo': ['one', 'one', 'one', 'two', 'two',
    ...                            'two'],
    ...                    'bar': ['A', 'B', 'C', 'A', 'B', 'C'],
    ...                    'baz': [1, 2, 3, 4, 5, 6],
    ...                    'zoo': ['x', 'y', 'z', 'q', 'w', 't']})
    >>> df
        foo   bar  baz  zoo
    0   one   A    1    x
    1   one   B    2    y
    2   one   C    3    z
    3   two   A    4    q
    4   two   B    5    w
    5   two   C    6    t

    >>> df.pivot(index='foo', columns='bar', values='baz')
    bar  A   B   C
    foo
    one  1   2   3
    two  4   5   6

    >>> df.pivot(index='foo', columns='bar')['baz']
    bar  A   B   C
    foo
    one  1   2   3
    two  4   5   6

    >>> df.pivot(index='foo', columns='bar', values=['baz', 'zoo'])
          baz       zoo
    bar   A  B  C   A  B  C
    foo
    one   1  2  3   x  y  z
    two   4  5  6   q  w  t

    You could also assign a list of column names or a list of index names.

    >>> df = pd.DataFrame({
    ...        "lev1": [1, 1, 1, 2, 2, 2],
    ...        "lev2": [1, 1, 2, 1, 1, 2],
    ...        "lev3": [1, 2, 1, 2, 1, 2],
    ...        "lev4": [1, 2, 3, 4, 5, 6],
    ...        "values": [0, 1, 2, 3, 4, 5]})
    >>> df
        lev1 lev2 lev3 lev4 values
    0   1    1    1    1    0
    1   1    1    2    2    1
    2   1    2    1    3    2
    3   2    1    2    4    3
    4   2    1    1    5    4
    5   2    2    2    6    5

    >>> df.pivot(index="lev1", columns=["lev2", "lev3"],values="values")
    lev2    1         2
    lev3    1    2    1    2
    lev1
    1     0.0  1.0  2.0  NaN
    2     4.0  3.0  NaN  5.0

    >>> df.pivot(index=["lev1", "lev2"], columns=["lev3"],values="values")
          lev3    1    2
    lev1  lev2
       1     1  0.0  1.0
             2  2.0  NaN
       2     1  4.0  3.0
             2  NaN  5.0

    A ValueError is raised if there are any duplicates.

    >>> df = pd.DataFrame({"foo": ['one', 'one', 'two', 'two'],
    ...                    "bar": ['A', 'A', 'B', 'C'],
    ...                    "baz": [1, 2, 3, 4]})
    >>> df
       foo bar  baz
    0  one   A    1
    1  one   A    2
    2  two   B    3
    3  two   C    4

    Notice that the first two rows are the same for our `index`
    and `columns` arguments.

    >>> df.pivot(index='foo', columns='bar', values='baz')
    Traceback (most recent call last):
       ...
    ValueError: Index contains duplicate entries, cannot reshape

In [150]:
help(df1.duplicated)

Help on method duplicated in module pandas.core.frame:

duplicated(subset: 'Hashable | Sequence[Hashable] | None' = None, keep: "Literal['first'] | Literal['last'] | Literal[False]" = 'first') -> 'Series' method of pandas.core.frame.DataFrame instance
    Return boolean Series denoting duplicate rows.

    Considering certain columns is optional.

    Parameters
    ----------
    subset : column label or sequence of labels, optional
        Only consider certain columns for identifying duplicates, by
        default use all of the columns.
    keep : {'first', 'last', False}, default 'first'
        Determines which duplicates (if any) to mark.

        - ``first`` : Mark duplicates as ``True`` except for the first occurrence.
        - ``last`` : Mark duplicates as ``True`` except for the last occurrence.
        - False : Mark all duplicates as ``True``.

    Returns
    -------
    Series
        Boolean series for each duplicated rows.

    See Also
    --------
    Index.duplicated : Equivalent method on index.
    Series.duplicated : Equivalent method on Series.
    Series.drop_duplicates : Remove duplicate values from Series.
    DataFrame.drop_duplicates : Remove duplicate values from DataFrame.

    Examples
    --------
    Consider dataset containing ramen rating.

    >>> df = pd.DataFrame({
    ...     'brand': ['Yum Yum', 'Yum Yum', 'Indomie', 'Indomie', 'Indomie'],
    ...     'style': ['cup', 'cup', 'cup', 'pack', 'pack'],
    ...     'rating': [4, 4, 3.5, 15, 5]
    ... })
    >>> df
        brand style  rating
    0  Yum Yum   cup     4.0
    1  Yum Yum   cup     4.0
    2  Indomie   cup     3.5
    3  Indomie  pack    15.0
    4  Indomie  pack     5.0

    By default, for each set of duplicated values, the first occurrence
    is set on False and all others on True.

    >>> df.duplicated()
    0    False
    1     True
    2    False
    3    False
    4    False
    dtype: bool

    By using 'last', the last occurrence of each set of duplicated values
    is set on False and all others on True.

    >>> df.duplicated(keep='last')
    0     True
    1    False
    2    False
    3    False
    4    False
    dtype: bool

    By setting ``keep`` on False, all duplicates are True.

    >>> df.duplicated(keep=False)
    0     True
    1     True
    2    False
    3    False
    4    False
    dtype: bool

    To find duplicates on specific column(s), use ``subset``.

    >>> df.duplicated(subset=['brand'])
    0    False
    1     True
    2    False
    3     True
    4     True
    dtype: bool

In [152]:
df1.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6    False
7    False
8    False
9    False
dtype: bool

In [153]:
help(df1.drop_duplicates)

Help on method drop_duplicates in module pandas.core.frame:

drop_duplicates(subset: 'Hashable | Sequence[Hashable] | None' = None, keep: "Literal['first'] | Literal['last'] | Literal[False]" = 'first', inplace: 'bool' = False, ignore_index: 'bool' = False) -> 'DataFrame | None' method of pandas.core.frame.DataFrame instance
    Return DataFrame with duplicate rows removed.

    Considering certain columns is optional. Indexes, including time indexes
    are ignored.

    Parameters
    ----------
    subset : column label or sequence of labels, optional
        Only consider certain columns for identifying duplicates, by
        default use all of the columns.
    keep : {'first', 'last', False}, default 'first'
        Determines which duplicates (if any) to keep.
        - ``first`` : Drop duplicates except for the first occurrence.
        - ``last`` : Drop duplicates except for the last occurrence.
        - False : Drop all duplicates.
    inplace : bool, default False
        Whether to drop duplicates in place or to return a copy.
    ignore_index : bool, default False
        If True, the resulting axis will be labeled 0, 1, …, n - 1.

        .. versionadded:: 1.0.0

    Returns
    -------
    DataFrame or None
        DataFrame with duplicates removed or None if ``inplace=True``.

    See Also
    --------
    DataFrame.value_counts: Count unique combinations of columns.

    Examples
    --------
    Consider dataset containing ramen rating.

    >>> df = pd.DataFrame({
    ...     'brand': ['Yum Yum', 'Yum Yum', 'Indomie', 'Indomie', 'Indomie'],
    ...     'style': ['cup', 'cup', 'cup', 'pack', 'pack'],
    ...     'rating': [4, 4, 3.5, 15, 5]
    ... })
    >>> df
        brand style  rating
    0  Yum Yum   cup     4.0
    1  Yum Yum   cup     4.0
    2  Indomie   cup     3.5
    3  Indomie  pack    15.0
    4  Indomie  pack     5.0

    By default, it removes duplicate rows based on all columns.

    >>> df.drop_duplicates()
        brand style  rating
    0  Yum Yum   cup     4.0
    2  Indomie   cup     3.5
    3  Indomie  pack    15.0
    4  Indomie  pack     5.0

    To remove duplicates on specific column(s), use ``subset``.

    >>> df.drop_duplicates(subset=['brand'])
        brand style  rating
    0  Yum Yum   cup     4.0
    2  Indomie   cup     3.5

    To remove duplicates and keep last occurrences, use ``keep``.

    >>> df.drop_duplicates(subset=['brand', 'style'], keep='last')
        brand style  rating
    1  Yum Yum   cup     4.0
    2  Indomie   cup     3.5
    4  Indomie  pack     5.0

In [154]:
df1.drop_duplicates(subset=['company', 'year'])

  company  year  sales  profits
0       A  2018    100       11
2       B  2018     89        9
3       C  2018     70        4
4       C  2019     85       17
5       B  2019     67       20
6       B  2020    110      -10
7       A  2019     76        7
8       D  2018     56        7
9       D  2019     71       18

In [155]:
pivot_data = data_df.pivot(index='company', columns='year', values='profits')

In [156]:
pivot_data

year     2018  2019  2020
company
A        11.0   7.0   NaN
B         9.0  20.0 -10.0
C         4.0  17.0   NaN
D         7.0  18.0   NaN

In [157]:
data_df

  company  year  sales  profits
0       A  2018    100       11
1       B  2018     89        9
2       C  2018     70        4
3       C  2019     85       17
4       B  2019     67       20
5       B  2020    110      -10
6       A  2019     76        7
7       D  2018     56        7
8       D  2019     71       18

In [158]:
data_df[(data_df['company'] == 'B')]['profits'].mean()

6.333333333333333

In [159]:
pivot_data.loc['B']

year
2018     9.0
2019    20.0
2020   -10.0
Name: B, dtype: float64

In [160]:
pivot_data.loc['B'].mean()

6.333333333333333

In [161]:
help(data_df.pivot_table)

Help on method pivot_table in module pandas.core.frame:

pivot_table(values=None, index=None, columns=None, aggfunc='mean', fill_value=None, margins=False, dropna=True, margins_name='All', observed=False, sort=True) -> 'DataFrame' method of pandas.core.frame.DataFrame instance
    Create a spreadsheet-style pivot table as a DataFrame.

    The levels in the pivot table will be stored in MultiIndex objects
    (hierarchical indexes) on the index and columns of the result DataFrame.

    Parameters
    ----------
    values : column to aggregate, optional
    index : column, Grouper, array, or list of the previous
        If an array is passed, it must be the same length as the data. The
        list can contain any of the other types (except list).
        Keys to group by on the pivot table index.  If an array is passed,
        it is being used as the same manner as column values.
    columns : column, Grouper, array, or list of the previous
        If an array is passed, it must be the same length as the data. The
        list can contain any of the other types (except list).
        Keys to group by on the pivot table column.  If an array is passed,
        it is being used as the same manner as column values.
    aggfunc : function, list of functions, dict, default numpy.mean
        If list of functions passed, the resulting pivot table will have
        hierarchical columns whose top level are the function names
        (inferred from the function objects themselves)
        If dict is passed, the key is column to aggregate and value
        is function or list of functions.
    fill_value : scalar, default None
        Value to replace missing values with (in the resulting pivot table,
        after aggregation).
    margins : bool, default False
        Add all row / columns (e.g. for subtotal / grand totals).
    dropna : bool, default True
        Do not include columns whose entries are all NaN.
    margins_name : str, default 'All'
        Name of the row / column that will contain the totals
        when margins is True.
    observed : bool, default False
        This only applies if any of the groupers are Categoricals.
        If True: only show observed values for categorical groupers.
        If False: show all values for categorical groupers.

        .. versionchanged:: 0.25.0

    sort : bool, default True
        Specifies if the result should be sorted.

        .. versionadded:: 1.3.0

    Returns
    -------
    DataFrame
        An Excel style pivot table.

    See Also
    --------
    DataFrame.pivot : Pivot without aggregation that can handle
        non-numeric data.
    DataFrame.melt: Unpivot a DataFrame from wide to long format,
        optionally leaving identifiers set.
    wide_to_long : Wide panel to long format. Less flexible but more
        user-friendly than melt.

    Examples
    --------
    >>> df = pd.DataFrame({"A": ["foo", "foo", "foo", "foo", "foo",
    ...                          "bar", "bar", "bar", "bar"],
    ...                    "B": ["one", "one", "one", "two", "two",
    ...                          "one", "one", "two", "two"],
    ...                    "C": ["small", "large", "large", "small",
    ...                          "small", "large", "small", "small",
    ...                          "large"],
    ...                    "D": [1, 2, 2, 3, 3, 4, 5, 6, 7],
    ...                    "E": [2, 4, 5, 5, 6, 6, 8, 9, 9]})
    >>> df
         A    B      C  D  E
    0  foo  one  small  1  2
    1  foo  one  large  2  4
    2  foo  one  large  2  5
    3  foo  two  small  3  5
    4  foo  two  small  3  6
    5  bar  one  large  4  6
    6  bar  one  small  5  8
    7  bar  two  small  6  9
    8  bar  two  large  7  9

    This first example aggregates values by taking the sum.

    >>> table = pd.pivot_table(df, values='D', index=['A', 'B'],
    ...                     columns=['C'], aggfunc=np.sum)
    >>> table
    C        large  small
    A   B
    bar one    4.0    5.0
        two    7.0    6.0
    foo one    4.0    1.0
        two    NaN    6.0

    We can also fill missing values using the `fill_value` parameter.

    >>> table = pd.pivot_table(df, values='D', index=['A', 'B'],
    ...                     columns=['C'], aggfunc=np.sum, fill_value=0)
    >>> table
    C        large  small
    A   B
    bar one      4      5
        two      7      6
    foo one      4      1
        two      0      6

    The next example aggregates by taking the mean across multiple columns.

    >>> table = pd.pivot_table(df, values=['D', 'E'], index=['A', 'C'],
    ...                     aggfunc={'D': np.mean,
    ...                              'E': np.mean})
    >>> table
                    D         E
    A   C
    bar large  5.500000  7.500000
        small  5.500000  8.500000
    foo large  2.000000  4.500000
        small  2.333333  4.333333

    We can also calculate multiple types of aggregations for any given
    value column.

    >>> table = pd.pivot_table(df, values=['D', 'E'], index=['A', 'C'],
    ...                     aggfunc={'D': np.mean,
    ...                              'E': [min, max, np.mean]})
    >>> table
                    D    E
                mean  max      mean  min
    A   C
    bar large  5.500000  9.0  7.500000  6.0
        small  5.500000  9.0  8.500000  8.0
    foo large  2.000000  5.0  4.500000  4.0
        small  2.333333  6.0  4.333333  2.0

In [164]:
data_df.pivot_table(values='profits', index='company', columns='year')

year     2018  2019  2020
company
A        11.0   7.0   NaN
B         9.0  20.0 -10.0
C         4.0  17.0   NaN
D         7.0  18.0   NaN

In [165]:
data_df.pivot_table(values='profits', index='company')

           profits
company
A         9.000000
B         6.333333
C        10.500000
D        12.500000

In [166]:
data_df

  company  year  sales  profits
0       A  2018    100       11
1       B  2018     89        9
2       C  2018     70        4
3       C  2019     85       17
4       B  2019     67       20
5       B  2020    110      -10
6       A  2019     76        7
7       D  2018     56        7
8       D  2019     71       18

In [167]:
data_df.pivot_table(values='profits', index='company', aggfunc=sum)

         profits
company
A             18
B             19
C             21
D             25

In [168]:
data_df.pivot_table(values='sales', index='company', aggfunc=sum)

         sales
company
A          176
B          266
C          155
D          127

In [169]:
# Comcatination of dataframes

In [170]:
df

   ids  names  percents sports  award grades
0  101  Alice      78.5     No  False      C
1  102   John      87.5     No  False      B
2  103   Mark      68.0    Yes  False      D
3  104  Carol      91.5    Yes   True      A
5  105    Dan      68.0     No  False      D

In [171]:
stu_data1 = {'names': ['Alice', 'Mark', 'John'],
           'ids': [101, 102, 103],
           'percents': [89.0, 77.5, 81.5]}

In [172]:
df1 = pd.DataFrame(stu_data1)

In [173]:
df1

   names  ids  percents
0  Alice  101      89.0
1   Mark  102      77.5
2   John  103      81.5

In [174]:
stu_data2 = {'names': ['Dan', 'Jill', 'Carol'],
           'ids': [201, 202, 203],
           'percents': [60.5, 91.0, 55.5]}

In [175]:
df2 = pd.DataFrame(stu_data2)

In [176]:
df1

   names  ids  percents
0  Alice  101      89.0
1   Mark  102      77.5
2   John  103      81.5

In [177]:
df2

   names  ids  percents
0    Dan  201      60.5
1   Jill  202      91.0
2  Carol  203      55.5

In [178]:
pd.concat([df1, df2])

   names  ids  percents
0  Alice  101      89.0
1   Mark  102      77.5
2   John  103      81.5
0    Dan  201      60.5
1   Jill  202      91.0
2  Carol  203      55.5

In [179]:
pd.concat([df1, df2], axis=0)

   names  ids  percents
0  Alice  101      89.0
1   Mark  102      77.5
2   John  103      81.5
0    Dan  201      60.5
1   Jill  202      91.0
2  Carol  203      55.5

In [180]:
pd.concat([df1, df2], axis=0, ignore_index=True)

   names  ids  percents
0  Alice  101      89.0
1   Mark  102      77.5
2   John  103      81.5
3    Dan  201      60.5
4   Jill  202      91.0
5  Carol  203      55.5

In [182]:
joined_df = pd.concat([df1, df2], axis=0, keys=['batch1', 'batch2'])

In [183]:
joined_df

          names  ids  percents
batch1 0  Alice  101      89.0
       1   Mark  102      77.5
       2   John  103      81.5
batch2 0    Dan  201      60.5
       1   Jill  202      91.0
       2  Carol  203      55.5

In [184]:
joined_df.loc[('batch1', 2)]

names       John
ids          103
percents    81.5
Name: (batch1, 2), dtype: object

In [185]:
df1

   names  ids  percents
0  Alice  101      89.0
1   Mark  102      77.5
2   John  103      81.5

In [186]:
df2

   names  ids  percents
0    Dan  201      60.5
1   Jill  202      91.0
2  Carol  203      55.5

In [187]:
pd.concat([df1, df2], axis=1)

   names  ids  percents  names  ids  percents
0  Alice  101      89.0    Dan  201      60.5
1   Mark  102      77.5   Jill  202      91.0
2   John  103      81.5  Carol  203      55.5

In [188]:
data3 = {'grades': ['B', 'C', 'B'],
        'sports': ['No', 'Yes', 'No']}

In [189]:
df3 = pd.DataFrame(data3)

In [190]:
df3

  grades sports
0      B     No
1      C    Yes
2      B     No

In [191]:
df1

   names  ids  percents
0  Alice  101      89.0
1   Mark  102      77.5
2   John  103      81.5

In [192]:
pd.concat([df1, df3], axis=1)

   names  ids  percents grades sports
0  Alice  101      89.0      B     No
1   Mark  102      77.5      C    Yes
2   John  103      81.5      B     No

In [193]:
data3 = {'grades': ['B', 'C', 'B', 'A'],
        'sports': ['No', 'Yes', 'No', 'No']}

In [194]:
df3 = pd.DataFrame(data3)

In [195]:
df3

  grades sports
0      B     No
1      C    Yes
2      B     No
3      A     No

In [196]:
pd.concat([df1, df3], axis=1)

   names    ids  percents grades sports
0  Alice  101.0      89.0      B     No
1   Mark  102.0      77.5      C    Yes
2   John  103.0      81.5      B     No
3    NaN    NaN       NaN      A     No